Repository: Johnson070/Mi-Band-5-watchface-editor
Catalog: MiBand5WatchFaces/Resources/Resource1.*.resx
Languages: ru, zh_cn

# ExitMessage
source: Do you want to get out without saving?
ru: Вы хотите выйти без сохрания?
zh_cn: 不保存即退出？

# ExitMessageCaption
source: Don't Save?
ru: Не сохранять?
zh_cn: 不保存？

source: Add image no alarm
ru: Добавить изобр. no alarm
zh_cn: 添加图像-无闹钟

source: Edit image no alarm
ru: Изменить изобр. no alarm
zh_cn: 编辑图像 无闹钟

source: Add image OFF
ru: Добавить изобр. выкл
zh_cn: 添加图像-关

source: Edit image OFF
ru: Изменить изобр. выкл
zh_cn: 编辑图像 关

source: Edit Image ON
ru: Изменить изобр. вкл
zh_cn: 编辑图像 开

source: Add image ON
ru: Добавить изобр. вкл
zh_cn: 添加图像-开

source: Add delimeter
ru: Добавить разделитель
zh_cn: 添加分隔符

source: Edit delimeter
ru: Изменить разделитель
zh_cn: 编辑分隔符

source: Add number
ru: Добавить Number
zh_cn: 添加数字

source: Edit number
ru: Изменить Number
zh_cn: 编辑数字

source: Edit monday image
ru: Изменить изобр. понедельника
zh_cn: 编辑 周一 图片

source: Edit tuesday image
ru: Изменить изобр. вторника
zh_cn: 编辑 周二 图片

source: Edit wednesday image
ru: Изменить изобр. среды
zh_cn: 编辑 周三 图片

source: Edit thursday image
ru: Изменить изобр. четверга
zh_cn: 编辑 周四 图片

source: Edit friday image
ru: Изменить изобр. пятницы
zh_cn: 编辑 周五 图像

source: Edit saturday image
ru: Изменить изобр. субботы
zh_cn: 编辑 周六 图片

source: Edit sunday image
ru: Изменить изобр. воскресенья
zh_cn: 编辑 周日 图片

source: Add monday image
ru: Добавить изобр. понедельника
zh_cn: 添加 周一 图像

source: Add tuesday image
ru: Добавить изобр. вторника
zh_cn: 添加 周二 图像

source: Add thursday image
ru: Добавить изобр. среды
zh_cn: 添加 周四 图像

source: Add wednesday image
ru: Добавить изобр. четверга
zh_cn: 添加 周三 图像

source: Add friday image
ru: Добавить изобр. пятницы
zh_cn: 添加 周五 图像

source: Add saturday image
ru: Добавить изобр. субботы
zh_cn: 添加 周六 图像

source: Add sunday image
ru: Добавить изобр. воскресенья
zh_cn: 添加 周日 图片

source: Edit images
ru: Изменить изобр.
zh_cn: 编辑图像

source: Add images
ru: Добавить изобр.
zh_cn: 添加图像

source: Edit arrow
ru: Изменить стрелку
zh_cn: 编辑箭头

source: Add arrow
ru: Добавить стрелку
zh_cn: 添加箭头

source: Edit center image
ru: Изменить центральное изобр.
zh_cn: 编辑中心图像

source: Add center image
ru: Добавить центральное изобр.
zh_cn: 添加中心图像

source: Edit prefix
ru: Изменить префикс
zh_cn: 编辑前缀

source: Add prefix
ru: Добавить префикс
zh_cn: 添加前缀

source: Add suffix
ru: Добавить суффикс
zh_cn: 添加后缀

source: Edit suffix
ru: Изменить суффикс
zh_cn: 编辑后缀

source: Edit degree image
ru: Изменить изобр. градусов
zh_cn: 编辑单位图像

source: Add degree image
ru: Добавить изобр. градусов
zh_cn: 添加单位图像

source: Edit minus image
ru: Изменить изобр. минуса
zh_cn: 编辑负号图像

source: Add minus image
ru: Добавить изобр. минуса
zh_cn: 添加 负号 图像

source: Edit suffix image
ru: Изменить изобр. суффикса
zh_cn: 编辑后缀图像

source: Add suffix image
ru: Добавить изобр. суффикса
zh_cn: 添加后缀图像

source: Edit delimeter image
ru: Изменить изобр. разделителя
zh_cn: 编辑分隔符图像

source: Add delimeter image
ru: Добавить изобр. разделителя
zh_cn: 添加分隔符图像

source: Edit image
ru: Изменить изобр.
zh_cn: 编辑图像

source: Add image
ru: Добавить изобр.
zh_cn: 添加图像

source: Edit circle scale
ru: Изменить круговую диаг.
zh_cn: 编辑圆圈比例

source: Add circle scale
ru: Добавить круговую диаг.
zh_cn: 添加圆形比例

source: Edit Ones
ru: Изменить единицы
zh_cn: 编辑个位

source: Add Ones
ru: Добавить единицы
zh_cn: 添加个位

source: Edit Tens
ru: Изменить десятки
zh_cn: 编辑十位

source: Add Tens
ru: Добавить десятки
zh_cn: 添加十位

source: Add no time
ru: Добавить no time
zh_cn: 添加无时间

source: Edit no time
ru: Изменить no time
zh_cn: 编辑无时间

# TimeFormError
source: Hours tens and hour ones and minute tens and minutes ones should be added! Exit without save?
ru: Единицы минут и часов, а также десятки минут и часов должны быть добавлены! Выход без сохранения?
zh_cn: 应添加“个十位”小时和“个十位”分钟！ 未保存就退出？

# ImageDPI
source: Image DPI is not 96!
ru: DPI изображения не 96!
zh_cn: 图像 DPI 非 96！

source: Edit images to element
ru: Изменить изобр. в элементе
zh_cn: 编辑图像到元素

source: Delete images
ru: Удалить изобр.
zh_cn: 删除图像

source: Add images to element
ru: Добавить изобр. в элементе
zh_cn: 添加图像到素材

source: Add steps
ru: Добавить шаги
zh_cn: 添加步数

source: Edit steps
ru: Изменить шаги
zh_cn: 编辑步数

source: Add calories
ru: Добавить калории
zh_cn: 添加卡路里

source: Edit calories
ru: Изменить калории
zh_cn: 编辑卡路里

source: Add pulse
ru: Добавить пульс
zh_cn: 添加 心率

source: Edit pulse
ru: Изменить пульс
zh_cn: 编辑心率

source: Add no data
ru: Добавить no data
zh_cn: 添加无数据

source: Edit no data
ru: Изменить no data
zh_cn: 编辑无数据

source: Add distance
ru: Добавить дистанцию
zh_cn: 添加距离

source: Edit distance
ru: Изменить дистанцию
zh_cn: 编辑距离

source: Add KM suffix
ru: Добавить KM суффикс
zh_cn: 添加公里后缀

source: Edit KM suffix
ru: Изменить KM суффикс
zh_cn: 编辑 KM 后缀

source: Add decimal point
ru: Добавить дес. точку
zh_cn: 添加小数点

source: Edit decimal point
ru: Изменить дес. точку
zh_cn: 编辑小数点

source: Add MI suffix
ru: Добавить MI суффикс
zh_cn: 添加英里后缀

source: Edit MI suffix
ru: Изменить MI суффикс
zh_cn: 编辑 MI 后缀

source: Add KM image
ru: Добавить изобр. KM
zh_cn: 添加公里图像

source: Edit KM image
ru: Изменить изобр. KM
zh_cn: 编辑 KM 图像

source: Add MI image
ru: Добавить изобр. MI
zh_cn: 添加英里图像

source: Edit MI image
ru: Изменить изобр. MI
zh_cn: 编辑 MI 图像

source: Add PAI
ru: Добавить PAI
zh_cn: 添加 PAI

source: Edit PAI
ru: Изменить PAI
zh_cn: 编辑 PAI

source: Add month
ru: Добавить месяц
zh_cn: 添加月份

source: Edit month
ru: Изменить месяц
zh_cn: 编辑月份

source: Add month images
ru: Добавить изобр. месяца
zh_cn: 添加月份图片

source: Edit month images
ru: Изменить изобр. месяца
zh_cn: 编辑月份图像

source: Add day
ru: Добавить день
zh_cn: 添加日期

source: Edit day
ru: Изменить день
zh_cn: 编辑日

source: Add month and day
ru: Добавить месяц и день
zh_cn: 添加 月日

source: Edit month and day
ru: Изменить месяц и день
zh_cn: 编辑 月 日

source: Add month and day and year
ru: Добавить месяц, день, год
zh_cn: 添加 年月日

source: Edit month and day and year
ru: Изменить месяц, день, год
zh_cn: 编辑 月 日 年

source: Add AM image
ru: Добавить изобр. AM
zh_cn: 添加 AM 图像

source: Edit AM image
ru: Изменить изобр. AM
zh_cn: 编辑上午图像

source: Add PM image
ru: Добавить изобр. PM
zh_cn: 添加 PM 图像

source: Edit PM image
ru: Изменить изобр. PM
zh_cn: 编辑 PM 图像

source: Add week days images
ru: Добавить изобр. дней недели
zh_cn: 添加 星期 图像

source: Edit week days images
ru: Изменить изобр. дней недели
zh_cn: 编辑 周 日 图像

# DeleteItem
source: The selected item will be deleted irretrievably. Are you sure?
ru: Выбранный элемент будет удалён безвозвратно. Вы уверены?
zh_cn: 选定的项目将会彻底删除，是否确认？

# SureQ
source: Are you sure?
ru: Вы уверены?
zh_cn: 是否确定？

source: Error!
ru: Ошибка!
zh_cn: 错误

# ErrorGenPreview
source: Error generate preview!
ru: Ошибка генерации preview!
zh_cn: 生成预览图失败

# SaveOpenJson
source: Save an open watchface before opening another watchface?
ru: Сохранить проект перед открытием другого?
zh_cn: 在打开另一个表盘之前保存当前打开的表盘？

# SaveQ
source: Save?
ru: Сохранить?
zh_cn: 保存？

# SaveFileClose
source: Save the file before closing the program?
ru: Сохранить проект в файл перед закрытием программы?
zh_cn: 在关闭程序之前保存文件？

# OpenDownloadUpdate
source: Download zip file with update?
ru: Скачать ZIP файл с обновлением?
zh_cn: 下载含有更新程序的 zip 压缩包？

source: Error save!
ru: Ошибка сохранения!
zh_cn: 保存失败

source: Update
ru: Обновление
zh_cn: 更新

source: Changelog
ru: Изменения
zh_cn: 更新日志

source: Not generated!
ru: Не сгенерировано!
zh_cn: 未生成

source: Succeful!
ru: Успех!
zh_cn: 成功

source: Complete
ru: Завершено
zh_cn: 完成

# ShowUpdateInfo
source: Program version: {0}. Program version on server: {1}
ru: Версия программы: {0}. Версия программы на сервере: {1}
zh_cn: 当前版本：{0}。 更新服务器上的最新版本：{1}

# UpdateDownloadExit
source: Downloading the update is complete!
ru: Загрузка обновления завершена!
zh_cn: 下载更新已经完成

# ConfigNotFound
source: File WatchFace.exe.config not found! Please fix file!
zh_cn: WatchFace.exe 配置丢失， 请修复文件！
